## [ethanhassett](https://hassettio.app.spacelift.io/stack/ethanhassett/run/01J9HS0NJ2X4R0PH7H4G8BKC4K) plan logs

<details>
<summary>Click here to expand</summary>

```
[01J9GQM6KFH74620B621FCHCSK] Planning changes with 0 custom hooks...
data.hcp_vault_secrets_secret.cloudflare_api_token: Reading...
data.hcp_vault_secrets_secret.google_credentials: Reading...
data.hcp_vault_secrets_secret.google_credentials: Read complete after 0s [id=spacelift]
data.hcp_vault_secrets_secret.cloudflare_api_token: Read complete after 0s [id=spacelift]
cloudflare_record.this["0"]: Refreshing state... [id=bacd1a05fe398a56b421ed113e33cd7d]
data.cloudflare_zone.this: Reading...
cloudflare_record.this["4"]: Refreshing state... [id=f1c76da2b4b9705c3f5897f372c717f4]
cloudflare_record.this["5"]: Refreshing state... [id=ca347d6c1d1cce3a7e4932e8ade94bdf]
cloudflare_record.this["6"]: Refreshing state... [id=75d78350d8439bfe3f3472420f41a72e]
cloudflare_record.this["3"]: Refreshing state... [id=ac5b87486600c02641153ba9840eb28d]
cloudflare_record.this["7"]: Refreshing state... [id=8294b351eb031747e8318087b1d7cf4e]
cloudflare_record.this["1"]: Refreshing state... [id=d8d3a7edcfa34a18a4f0f97ef6512aef]
cloudflare_record.this["2"]: Refreshing state... [id=0ba33e955934a05cc8a6b2efbff7a36e]
google_service_account.cloud_run: Refreshing state... [id=projects/ethanhassett/serviceAccounts/cloudrun@ethanhassett.iam.gserviceaccount.com]
google_project_iam_binding.service_account_user: Refreshing state... [id=ethanhassett/roles/iam.serviceAccountUser]
google_cloud_run_v2_service.this: Refreshing state... [id=projects/ethanhassett/locations/us-east1/services/ethanhassett]
google_project_iam_binding.cloud_run_admin: Refreshing state... [id=ethanhassett/roles/run.admin]
google_cloud_run_service_iam_binding.this: Refreshing state... [id=v1/projects/ethanhassett/locations/us-east1/services/ethanhassett/roles/run.invoker]
google_cloud_run_domain_mapping.this: Refreshing state... [id=locations/us-east1/namespaces/ethanhassett/domainmappings/ethanhassett.com]
data.cloudflare_zone.this: Read complete after 2s [id=f96446d78e054da3fe5c6ace7557f782]
cloudflare_record.www["4"]: Refreshing state... [id=ee5c6108d5b56dfd34f855a75ce94be5]
cloudflare_record.www["2"]: Refreshing state... [id=d80b662c7ae77cd390a4ff9e3f67b7a1]
cloudflare_record.www["0"]: Refreshing state... [id=e577b05e1d29211d431f5ac83d63e970]
cloudflare_record.www["1"]: Refreshing state... [id=3579ea6cd73550065e494b5d3f1e06e4]
cloudflare_record.www["3"]: Refreshing state... [id=049ac7878b150072453e54fed5a3545b]
cloudflare_record.www["5"]: Refreshing state... [id=cc596c0579d9f7e57e3cfc3ddeb58dfb]
cloudflare_record.www["7"]: Refreshing state... [id=bcc07bda21a32c21f73acc351566eae3]
cloudflare_record.www["6"]: Refreshing state... [id=b15204924496af96a46753a407c437c7]

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

OpenTofu will perform the following actions:

  # cloudflare_record.a["216.239.32.21"] will be created
  + resource "cloudflare_record" "a" {
      + allow_overwrite = false
      + content         = "216.239.32.21"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "@"
      + proxiable       = (known after apply)
      + ttl             = 300
      + type            = "A"
      + value           = (known after apply)
      + zone_id         = "f96446d78e054da3fe5c6ace7557f782"
    }

  # cloudflare_record.a["216.239.34.21"] will be created
  + resource "cloudflare_record" "a" {
      + allow_overwrite = false
      + content         = "216.239.34.21"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "@"
      + proxiable       = (known after apply)
      + ttl             = 300
      + type            = "A"
      + value           = (known after apply)
      + zone_id         = "f96446d78e054da3fe5c6ace7557f782"
    }

  # cloudflare_record.a["216.239.36.21"] will be created
  + resource "cloudflare_record" "a" {
      + allow_overwrite = false
      + content         = "216.239.36.21"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "@"
      + proxiable       = (known after apply)
      + ttl             = 300
      + type            = "A"
      + value           = (known after apply)
      + zone_id         = "f96446d78e054da3fe5c6ace7557f782"
    }

  # cloudflare_record.a["216.239.38.21"] will be created
  + resource "cloudflare_record" "a" {
      + allow_overwrite = false
      + content         = "216.239.38.21"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "@"
      + proxiable       = (known after apply)
      + ttl             = 300
      + type            = "A"
      + value           = (known after apply)
      + zone_id         = "f96446d78e054da3fe5c6ace7557f782"
    }

  # cloudflare_record.aaaa["2001:4860:4802:32::15"] will be created
  + resource "cloudflare_record" "aaaa" {
      + allow_overwrite = false
      + content         = "2001:4860:4802:32::15"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "@"
      + proxiable       = (known after apply)
      + ttl             = 300
      + type            = "AAAA"
      + value           = (known after apply)
      + zone_id         = "f96446d78e054da3fe5c6ace7557f782"
    }

  # cloudflare_record.aaaa["2001:4860:4802:34::15"] will be created
  + resource "cloudflare_record" "aaaa" {
      + allow_overwrite = false
      + content         = "2001:4860:4802:34::15"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "@"
      + proxiable       = (known after apply)
      + ttl             = 300
      + type            = "AAAA"
      + value           = (known after apply)
      + zone_id         = "f96446d78e054da3fe5c6ace7557f782"
    }

  # cloudflare_record.aaaa["2001:4860:4802:36::15"] will be created
  + resource "cloudflare_record" "aaaa" {
      + allow_overwrite = false
      + content         = "2001:4860:4802:36::15"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "@"
      + proxiable       = (known after apply)
      + ttl             = 300
      + type            = "AAAA"
      + value           = (known after apply)
      + zone_id         = "f96446d78e054da3fe5c6ace7557f782"
    }

  # cloudflare_record.aaaa["2001:4860:4802:38::15"] will be created
  + resource "cloudflare_record" "aaaa" {
      + allow_overwrite = false
      + content         = "2001:4860:4802:38::15"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "@"
      + proxiable       = (known after apply)
      + ttl             = 300
      + type            = "AAAA"
      + value           = (known after apply)
      + zone_id         = "f96446d78e054da3fe5c6ace7557f782"
    }

  # cloudflare_record.www will be created
  + resource "cloudflare_record" "www" {
      + allow_overwrite = false
      + content         = "ghs.googlehosted.com."
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "www"
      + proxiable       = (known after apply)
      + ttl             = 300
      + type            = "CNAME"
      + value           = (known after apply)
      + zone_id         = "f96446d78e054da3fe5c6ace7557f782"
    }

  # google_cloud_run_domain_mapping.this is tainted, so it must be replaced
-/+ resource "google_cloud_run_domain_mapping" "this" {
      ~ id       = "locations/us-east1/namespaces/ethanhassett/domainmappings/ethanhassett.com" -> (known after apply)
        name     = "ethanhassett.com"
      ~ status   = [
          - {
              - conditions          = [
                  - {
                      - message = "Waiting for certificate provisioning. You must configure your DNS records for certificate issuance to begin."
                      - reason  = "CertificatePending"
                      - status  = "Unknown"
                      - type    = "Ready"
                    },
                  - {
                      - message = "Certificate issuance pending."
                      - reason  = "CertificatePending"
                      - status  = "Unknown"
                      - type    = "CertificateProvisioned"
                    },
                  - {
                      - message = ""
                      - reason  = ""
                      - status  = "True"
                      - type    = "DomainRoutable"
                    },
                  - {
                      - message = "System will retry after 0:01:00 from lastTransitionTime for polling interval"
                      - reason  = "WaitingForOperation"
                      - status  = "True"
                      - type    = "Retry"
                    },
                ]
              - mapped_route_name   = "ethanhassett"
              - observed_generation = 1
              - resource_records    = [
                  - {
                      - name   = ""
                      - rrdata = "216.239.32.21"
                      - type   = "A"
                    },
                  - {
                      - name   = ""
                      - rrdata = "216.239.34.21"
                      - type   = "A"
                    },
                  - {
                      - name   = ""
                      - rrdata = "216.239.36.21"
                      - type   = "A"
                    },
                  - {
                      - name   = ""
                      - rrdata = "216.239.38.21"
                      - type   = "A"
                    },
                  - {
                      - name   = ""
                      - rrdata = "2001:4860:4802:32::15"
                      - type   = "AAAA"
                    },
                  - {
                      - name   = ""
                      - rrdata = "2001:4860:4802:34::15"
                      - type   = "AAAA"
                    },
                  - {
                      - name   = ""
                      - rrdata = "2001:4860:4802:36::15"
                      - type   = "AAAA"
                    },
                  - {
                      - name   = ""
                      - rrdata = "2001:4860:4802:38::15"
                      - type   = "AAAA"
                    },
                ]
            },
        ] -> (known after apply)
        # (2 unchanged attributes hidden)

      ~ metadata {
          - annotations           = {} -> null
          ~ effective_annotations = {
              - "run.googleapis.com/operation-id"  = "4efe0a9c-8cf6-46b2-a09c-508ecc8072f3"
              - "serving.knative.dev/creator"      = "ethan@hassett.io"
              - "serving.knative.dev/lastModifier" = "ethan@hassett.io"
            } -> (known after apply)
          ~ effective_labels      = {
              - "cloud.googleapis.com/location" = "us-east1" -> null
              + "goog-terraform-provisioned"    = "true"
              + "repo"                          = "ethanhassett"
              - "run.googleapis.com/overrideAt" = "2024-10-06T20:29:45.373Z" -> null
            }
          ~ generation            = 1 -> 0
          - labels                = {} -> null
          ~ resource_version      = "AAYj1N2+yos" -> (known after apply)
          ~ self_link             = "/apis/domains.cloudrun.com/v1/namespaces/1016775760988/domainmappings/ethanhassett.com" -> (known after apply)
          ~ terraform_labels      = {
              ~ "goog-terraform-provisioned" = "" -> "true"
              ~ "repo"                       = "" -> "ethanhassett"
            }
          ~ uid                   = "fefda88f-81a0-4b5f-9837-ccfb1768180c" -> (known after apply)
            # (1 unchanged attribute hidden)
        }

      ~ spec {
          - force_override   = false -> null
            # (2 unchanged attributes hidden)
        }
    }

  # google_cloud_run_domain_mapping.www will be created
  + resource "google_cloud_run_domain_mapping" "www" {
      + id       = (known after apply)
      + location = "us-east1"
      + name     = "www.ethanhassett.com"
      + project  = "ethanhassett"
      + status   = (known after apply)

      + metadata {
          + effective_annotations = (known after apply)
          + effective_labels      = {
              + "goog-terraform-provisioned" = "true"
              + "repo"                       = "ethanhassett"
            }
          + generation            = 0
          + namespace             = "ethanhassett"
          + resource_version      = (known after apply)
          + self_link             = (known after apply)
          + terraform_labels      = {
              + "goog-terraform-provisioned" = "true"
              + "repo"                       = "ethanhassett"
            }
          + uid                   = (known after apply)
        }

      + spec {
          + certificate_mode = "AUTOMATIC"
          + route_name       = "ethanhassett"
        }
    }

Plan: 11 to add, 0 to change, 1 to destroy.

[01J9GQM6KFH74620B621FCHCSK] Changes are GO
[01J9GQM6KFH74620B621FCHCSK] Uploading the list of managed resources...
[01J9GQM6KFH74620B621FCHCSK] Please be aware that the run changes calculation includes output changes.
[01J9GQM6KFH74620B621FCHCSK] Resource list upload is GO
[01J9GQM6KFH74620B621FCHCSK] Generating JSON representation of the plan...
[01J9GQM6KFH74620B621FCHCSK] JSON representation is GO
[01J9GQM6KFH74620B621FCHCSK] Loading custom plan policy inputs...
[01J9GQM6KFH74620B621FCHCSK] 0 custom plan policy inputs found
[01J9GQM6KFH74620B621FCHCSK] No plan policies to evaluate
```

</details>